
// 1|__|__|__|__|__|__|01|02|03|04|05|06|||__|__|__|__|__|__|01|02|
// 2|__|__|__|__|__|07|08|09|10|11|12|__|||__|__|__|__|__|03|04|__|
// 3|__|__|__|__|13|14|15|16|17|18|__|__|||__|__|__|__|05|06|__|__|
// 4|__|__|__|19|20|21|22|23|24|__|__|__|||__|__|__|07|08|__|__|__|
// 5|__|__|25|26|27|28|29|30|__|__|__|__|||__|__|09|10|__|__|__|__|
// 6|__|31|32|33|34|35|36|__|__|__|__|__|||__|11|12|__|__|__|__|__|
// 7|37|38|39|40|41|42|__|__|__|__|__|__|||13|14|__|__|__|__|__|__|
// 1-36  12-36  10-27  9-28  14-28  20-23  8-8

#include <stdio.h>
#include <locale.h>
#include <stdlib.h>
#include "king.h"

void main()
{
	setlocale(LC_ALL, "RUS");
	int cells = 0, lines, start_point, end_point;

	cells = input("введите число элементов в строке: ", cells, 1); //нужно прочитать 1 элемент	//количество элементов в строке
	if (cells < 2)
	{	
		printf("неверный ввод");
		return;
	}
	lines = input("введите число строк: ", cells, 1); //нужно прочитать 1 элемент	// количество строк
	start_point = input("введите номер строки и позицию в строке дл€ начального положени€: ", cells, 2); //нужно прочитать 2 элемента	//начальное положение
	end_point = input("введите номер строки и позицию в строке дл€ конечного положени€: ", cells, 2); //нужно прочитать 2 элемента	//конечное положение
	if (start_point > cells* lines || end_point > cells* lines || start_point == 0 || end_point == 0)
	{
		printf("неверный ввод");
		return;
	}
	int* way;
	way = malloc(1 * sizeof(int));
	int arr[2];	// arr[0] - количество шагов, arr[1] - последн€€ клетка
	arr[0] = 0;
	arr[1] = start_point;
	way[arr[0]] = start_point;
	if (start_point > end_point)
		way = up(way, cells, arr, end_point);	// выбираем куда двигатьс€ (верх/низ)
	else way = down(way, cells, arr, end_point);
	for (int k = 0; k <= arr[0]; k++)	// вывод
		printf("%d ", way[k]);
	free(way);
}